## 자동차 레이더 공정과정 소개

1. 차량용 센서 종류와 장단점
2. 레이더의 기본적인 원리와 부품 구성 살펴보기
3. 일반적인 레이더 양산 공정 알아보기

### 차량용 센서 종류와 장단점

---

1. 카메라
    1. Texture 해석 가능
    2. 조명, 날씨에 취약함
    3. 거리 중간 ~ 멀리
    4. 해상도 높음
    5. 최대 장점 : 사물의 질감 및 대상 분류 능력
2. 레이더
    1. Texture 해석 불가능
    2. 조명, 날씨에 상관 없음
    3. 거리 가까이 ~ 멀리
    4. 해상도 중간
    5. 최대 장점 : 움직임 속도 정보까지 파악
3. Sensor Fusion
    1. Texture 해석 가능
    2. 조명, 날씨에 상관 없음
    3. 거리 가까이 ~ 멀리
    4. 해상도 높음
    5. 두가지 이상의 여러가지 센서를 사용하는 방식

### 레이더의 기본적인 원리와 부품 구성

---

레이더의 기본원리

잠깐! GPS 란?

<aside>
💡 GPS 위성 시스템은 30개 안팎의 위성으로 구성되어 있음.
위성으로 부터 신호를 받음 → 신호가 도달하는 시간으로 위성과 수신기 간의 거리 파악 → 3~4개 사이의 위성까지의 거리를 파악하여 수신기의 위치 특정

</aside>

1. 장애물은 위성처럼 신호를 보낼 수 없음
2. 송신 레이더에서 신호 발생 → 탐지 대상에게서 반사된 신호 수신 안테나로 받아서 거리, 각도, 속도 측정
3. 여러 개의 안테나를 사용하여 여러 개의 GPS위성과 같은 효과를 가짐 → 해상도 향상

레이더부품의 구성

1. Radome → 보호막
2. PCB기판 ( RF / Shielding / PCB ) or ( 간소화하여 하나로 PCB )

### 레이더의 양산 공정

---

1. TIM 도포 과정
    1. 열이 많이 나는 소자와 실딩 사이 TIM을 머신으로 도포함
2. 도포 후 PCB 얹기
3. 프레스핏 → PCB를 일정 힘으로 눌러서 커넥터 pin 삽입
4. 스크류 조립 과정
    1. PCB가 단단히 고정되도록 나사를 체결
    2. 체결시 토크, 회전수, 체결 시간에 대해 확인 및 기록함
5. Sealant 도포과정
    1. 방수 성능 만족을 위해 Sealant 혹은 본드 성분을 흘려주어 밀폐될 수 있도록 함
    2. 비전 검사를 통해 도포 상태를 점검함
6. 레이돔 조립
    1. 레이돔은 레이더 전파 신호의 감쇄가 적고 이물질이 잘 안묻어야 좋음
    2. 레이돔 조립 후 평탄도 검사
7. 공정 후 PCB , RF 부품, 하우징 조립 등에 의해 편차가 발생
8. Calibration 과정을 통해 레이더의 수평/수직 시야각 범위에서 안테나 성능을 균일하게 보정
9. 로봇이 레이더 센서를 이동하면서 보정 실시
